#+BEGIN_EXPORT html
---
layout: page
title: SQLAlchemy
tagline: " brief overivew"
permalink: /python/sqlalchemy-dissection.html
categories: [SQLAlchemy, Python]
tags: [overview]
---
#+END_EXPORT
#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+PROPERTY: header-args :exports both
#+PROPERTY: header-args+ :results output pp
#+PROPERTY: header-args+ :eval no-export
#+PROPERTY: header-args+ :session sqlalchemy
#+PROPERTY: vizier-thread-id thread_SZn8OENkzkrgpweWP1ll6pj0
#+PROPERTY: vizier-assistant-id asst_9U8N72u9uVQesQNNjgOLJOu8
#+TOC: headlines 4
* Prerequisites

#+begin_src sh
pip install sqlalchemy
#+end_src

#+RESULTS:
#+begin_example
Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.31-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (3.2 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.2/3.2 MB 3.6 MB/s eta 0:00:00
=4.6.0 in /home/alioth/.virtualenvs/FastAPI/lib/python3.11/site-packages (from sqlalchemy) (4.12.2)
Collecting greenlet!=0.4.17
  Downloading greenlet-3.0.3-cp311-cp311-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl (620 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 620.0/620.0 kB 4.0 MB/s eta 0:00:00

Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-3.0.3 sqlalchemy-2.0.31
#+end_example

** Below is an example

Demonstrating the basic usage of both SQLAlchemy Core and SQLAlchemy
ORM:

#+begin_src python
from sqlalchemy import create_engine, Table, Column, Integer, String, MetaData
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker

# SQLAlchemy Core Example
# Create an engine and connect to the database (SQLite in this case)
engine = create_engine('sqlite:///:memory:', echo=True)
metadata = MetaData()

# Define a table using SQLAlchemy Core
user_table = Table('users', metadata, Column('id', Integer,
                   primary_key=True), Column('name', String),
                   Column('age', Integer))

# Create the table in the database
metadata.create_all(engine)

# SQLAlchemy ORM Example
# Define a declarative base class
Base = declarative_base()

# Define a User class mapped to the 'users' table


class User(Base):
    __tablename__ = 'users'
    id = Column(Integer, primary_key=True)
    name = Column(String)
    age = Column(Integer)


# Create a session
Session = sessionmaker(bind=engine)
session = Session()

# Add a new user to the database
new_user = User(name="Alice", age=30)
session.add(new_user)
session.commit()

# Query the database
for user in session.query(User).all():
    print(user.id, user.name, user.age)
#+end_src

#+RESULTS:
#+begin_example
2024-07-20 10:33:03,681 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-07-20 10:33:03,682 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("users")
2024-07-20 10:33:03,682 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-07-20 10:33:03,682 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("users")
2024-07-20 10:33:03,683 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-07-20 10:33:03,683 INFO sqlalchemy.engine.Engine 
CREATE TABLE users (
	id INTEGER NOT NULL, 
	name VARCHAR, 
	age INTEGER, 
	PRIMARY KEY (id)
)


2024-07-20 10:33:03,684 INFO sqlalchemy.engine.Engine [no key 0.00011s] ()
2024-07-20 10:33:03,684 INFO sqlalchemy.engine.Engine COMMIT
/tmp/babel-C8lSuP/python-uwm0l3:20: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()
2024-07-20 10:33:03,688 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-07-20 10:33:03,690 INFO sqlalchemy.engine.Engine INSERT INTO users (name, age) VALUES (?, ?)
2024-07-20 10:33:03,690 INFO sqlalchemy.engine.Engine [generated in 0.00016s] ('Alice', 30)
2024-07-20 10:33:03,690 INFO sqlalchemy.engine.Engine COMMIT
2024-07-20 10:33:03,691 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-07-20 10:33:03,692 INFO sqlalchemy.engine.Engine SELECT users.id AS users_id, users.name AS users_name, users.age AS users_age 
FROM users
2024-07-20 10:33:03,692 INFO sqlalchemy.engine.Engine [generated in 0.00013s] ()
1 Alice 30
#+end_example

#+begin_src python
# Add another user to the database
new_user = User(name="Bob", age=32)
session.add(new_user)
session.commit()

# Query the database
for user in session.query(User).all():
    print(user.id, user.name, user.age)
#+end_src

#+RESULTS:
: 2024-07-20 10:35:27,323 INFO sqlalchemy.engine.Engine INSERT INTO users (name, age) VALUES (?, ?)
: 2024-07-20 10:35:27,323 INFO sqlalchemy.engine.Engine [cached since 143.6s ago] ('Bob', 32)
: 2024-07-20 10:35:27,323 INFO sqlalchemy.engine.Engine COMMIT
: 2024-07-20 10:35:27,323 INFO sqlalchemy.engine.Engine BEGIN (implicit)
: 2024-07-20 10:35:27,324 INFO sqlalchemy.engine.Engine SELECT users.id AS users_id, users.name AS users_name, users.age AS users_age 
: FROM users
: 2024-07-20 10:35:27,324 INFO sqlalchemy.engine.Engine [cached since 143.6s ago] ()
: 1 Alice 30
: 2 Bob 32

*** 2. Maintainability:

#+begin_src python
# Alter the User class to add a new column
# class User(Base):
#     __tablename__ = 'users'
#     id = Column(Integer, primary_key=True)
#     name = Column(String)
#     age = Column(Integer)
#     email = Column(String)  # Added column

# # Reflect the changes in the database schema
# Base.metadata.create_all(engine)

for user in session.query(User).all():
    print(user.id, user.name, user.age)
#+end_src

#+RESULTS:
: 2024-07-20 10:46:30,462 INFO sqlalchemy.engine.Engine SELECT users.id AS users_id, users.name AS users_name, users.age AS users_age 
: FROM users
: 2024-07-20 10:46:30,462 INFO sqlalchemy.engine.Engine [cached since 806.8s ago] ()
: 1 Alice 30
: 2 Bob 32


